Revit 2027 API
ScheduleSortGroupField.ShowFooterCount Property
 Indicates if the footer row should display a count of elements in the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowFooterCount { get; set; }
Public Property ShowFooterCount As Boolean
	Get
	Set
public:
property bool ShowFooterCount {
	bool get ();
	void set (bool value);
}
member ShowFooterCount : bool with get, set
Property Value
Boolean
 True if an element count should be displayed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Display of footer rows is not enabled.
Remarks
 ShowFooterCount can only be enabled if ShowFooter is enabled.
See Also
Reference
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace